package Fedor.les02_12Operators;

public class Methods02_16 {
    /*K.alinka
Я снова не поняла?
Ну, в этот раз лучше) Тогда вызови метод с параметром int и возвращаемым значением int, передай в него 5.
K.alinka
Это не про алгоритм и логику, да?
Это как раз про логику) Тут нужно её проявить)
Идея у меня такая, тебе надо писать только так, чтобы использовались везде только переменные,
все литералы спрчтать в переменные, и называть их по их предназначению.
Вообще не использовать пока инкремент, он тебе мешает, используй обычное сложение.
     */
                public int input ( int value){
                        return value;
        }


    }


