package homeWorks.lesson6Methods;

//[13:24, 26/01/2021] Наталья Шульга Java:
/* Метод должен возвращать количество гласных букв в тексте (String text),
учтите что метод должен считать как большие так и маленькие гласные буквы (vowels [ˈvaʊəls])
public static int countGlass(String text);
 and
Метод должен возвращать количество согласных букв (consonants) в тексте (String text),
учтите что метод должен считать как большие так и маленькие буквы
public static int countSoglasnie(String text);

[13:26, 26/01/2021] Наталья Шульга Java: 1) Написать метод, который будет принимать входящими параметрами 3 числа. Сам метод будет печатать на консоль большее число из трех.
2) Написать метод, который будет выводить на консоль сумму слов внутри текста (текст передаем в метод входящими параметрами)

 */

//public class Lesson6Task1Alina {
//    public static int countVowel(String text) {
//        int conter = 0;
//
//
//    }
//}



